[
{"FrostyAnkles": " Hey guys/gals  I have been having tough time trying to pick my \"first\" dudes on a map game.  There seems to be a lot of good options and its tough to know what I will enjoy.   I caught bug after playing  Root . While I enjoy the game It left me wanting more. It seems to suffer from balance issues and I am not a big fan of the combat. This is my opinion of course.   I have been considering the following games and would appreciate any input on the subject.   Kemet   Cyclades   Cry Havoc   Nexus Ops   I really appreciate the help guys.   "},
{"Swaygodeus": " Haven't played any of those but Kemet seems to get high praise. I guess part of it would be what you are looking for? Area control? Dice/No Dice?  I would hands down recommend  Blood Rage  as it's just such a finely tuned game.  "},
{"AHShole": "  FrostyAnkles wrote:  Hey guys/gals  I have been having tough time trying to pick my \"first\" dudes on a map game.  There seems to be a lot of good options and its tough to know what I will enjoy.   I caught bug after player  Root . While I enjoy the game It left me wanting more. It seems to suffer from balance issues and I am not a big fan of the combat. This is my opinion of course.   I have been considering the following games and would appreciate any input on the subject.   Kemet   Cyclades   Cry Havoc   Nexus Ops   I really appreciate the help guys.     I havent played Root.  What didnt you like about the combat in it? "},
{"Saytrsong": "  Lords of Hellas  for sure! "},
{"crazybyzantine": " If it’s your first one, Nexus Ops.  It’s widely seen as the essence of the genre and simple mechanics.  Then branch out to all the others. "},
{"FrostyAnkles": "  AHShole wrote:   FrostyAnkles wrote:  Hey guys/gals  I have been having tough time trying to pick my \"first\" dudes on a map game.  There seems to be a lot of good options and its tough to know what I will enjoy.   I caught bug after player  Root . While I enjoy the game It left me wanting more. It seems to suffer from balance issues and I am not a big fan of the combat. This is my opinion of course.   I have been considering the following games and would appreciate any input on the subject.   Kemet   Cyclades   Cry Havoc   Nexus Ops   I really appreciate the help guys.     I havent played Root.  What didnt you like about the combat in it?   1. Randomness of dice rolls. 2. Luck of draw for ambush cards.   I am fine with some luck but it felt like if you drew really poorly and rolled badly then it didnt matter what your strategy was. There were some things to offset this but overall It lacked the epic struggle I was looking for. Still a great game but did not scratch my itch.  "},
{"TeeJz": " How about Scythe?  Although eng bldg game does have combat and cool minis   "},
{"andreiszabo": " From your list, I would choose Kemet. But you're missing out on the greatest area control game ever...  El Grande ! "},
{"FrostyAnkles": "  Saytrsong wrote:   Lords of Hellas  for sure!   I considered Lord of hellas but for the price I could get 2 on the list.  "},
{"krede60": " I dont think you can wrong with Rising Sun as a dudes on a map game.  Also, the combat system is unique and definitely not random.  It's a tough sstem with a lot of guessing (you need to figure out what your opponent is likely to do and plan ahead even before that to have enough resources, but it's not at all random.    I dont know enough about the games already on your list to make a suggestion from those.   "},
{"stanstanminson": "  TeeJz wrote:  How about Scythe?  Although eng bldg game does have combat and cool minis    There's not enough (and sometimes no) combat in a game of Scythe to qualify it as a Dudes on a Map game. "},
{"stanstanminson": "  andreiszabo wrote:  From your list, I would choose Kemet. But you're missing out on the greatest area control game ever...  El Grande !  Nitpick but El Grande is an area influence game, not area control. Dudes on a Map games are almost always area control. "},
{"snapdragon23": "  Carcassonne.   Surely that counts   "},
{"FrostyAnkles": "  stanstanminson wrote:   TeeJz wrote:  How about Scythe?  Although eng bldg game does have combat and cool minis    There's not enough (and sometimes no) combat in a game of Scythe to qualify it as a Dudes on a Map game.   This.  Plus I will add that I am not a fan of Scythe. I may even go as far as to say I dislike it.  "},
{"FrostyAnkles": "  snapdragon23 wrote:   Carcassonne.   Surely that counts        I think you confused Dudes on a map with meeples on tiles.   "},
{"snapdragon23": "  FrostyAnkles wrote:   snapdragon23 wrote:   Carcassonne.   Surely that counts        I think you confused Dudes on a map with meeples on tiles.     Meeples are peoples too...? "},
{"Saytrsong": "  FrostyAnkles wrote:   Saytrsong wrote:   Lords of Hellas  for sure!   I considered Lord of hellas but for the price I could get 2 on the list.    True, it is a little pricey, but you definitely get your money's worth. Quality is top notch, solo play works well and overall replayabliity has been great for me so far.    Another really good one is  Dust . Still a little on the pricey side and you'd have to snag one from ebay or the geek market.  "},
{"Bulldog74": "  Swaygodeus wrote:  Haven't played any of those but Kemet seems to get high praise. I guess part of it would be what you are looking for? Area control? Dice/No Dice?  I would hands down recommend  Blood Rage  as it's just such a finely tuned game.    If you are looking for more strategy and less luck. I recommend blood rage as well.  I also like zombicide: black plague but that adds more luck.  "},
{"vanquish7": " Would second Blood Rage or Root.  Blood Rage if you like crazy combos and bluffing. It very easy to pick up and play as well. The whole 'you can win by losing' thing is genius as unlike typical area control/war games, in Blood Rage (and Rising Sun too) you are unsure about whether attacking your opponents is a good idea or not - as they might be wanting you to attack them all along! Which leads to lots of mind games (not to mention the ensuing cursing and general hilarity).  Root if you want more of a traditional war game with dice rolls but with such a great deal of asymmetry that some factions aren't even playing an area control game. It isn't actually that hard to teach as most of what players need to know is printed on their player mats. The biggest problem with Root is that turns are long until players are experienced with the game.  And I'd definitely not consider Scythe as scratching the 'dudes on a map' itch, it's very much a euro engine builder with some combat tacked on (and players aren't encouraged to go out and fight their opponents either).  Heard good things about Lords of Hellas and Kemet as well but yet to try them.  Rising Sun is also great, but it's more a game of diplomatic war like the Game of Thrones game, which might not be to everyones taste. You certainly have a lot less player agency compared to Blood Rage or Root. "},
{"Jopo43": " BLOOD RAGE!!!!! "},
{"pacman88k": " If conflict is important,  Inis .  If not,  Scythe . "},
{"kaziam": " Don’t forget  Inis . Minimalistic, gorgeous and very thinky with 3 win conditions.  You’re definitely playing against the players here. "},
{"Valnar": " If you want a FUN \"dudes on a map\" game try Smallworld. Or if you want a real \"dudes on a map\" game try a wargame like Battle of the Bulge: Celles, see Stuka Joe's excellent video.  "},
{"Denga": " Scythe is my favorite but definitely lower on the player conflict side (so freaking great though).  Blood Rage is probably my favorite conflict driven game like this because it’s fun, has great cinematic moments, and plays quick.  If you want something heavier and more asymmetric then Cthulhu Wars is another good one. "},
{"Surge1000": " Of those you listed, Kemet is best by a mile. "},
{"jokris": " We were playing some games today (30-35 year old friends).  However  Camel Up  was too many rules for some of them and we also felt we had to wait a bit too long for our turn. Las Vegas was not everyone's cup of tea either, slightly because of the downtime until your next turn.  Games that were successful and brought us a lot of laughs were:  * Cards Against Humanity * Telestrations * Going Going Gone * Diamant  Next time we will probably try Mysterium.  What other fun games would you recommend?  I guess I am looking for: * easy rules * fun * short downtime until your next turn * 4-5 players "},
{"odie73": "   Bohnanza : Trading game which involves everyone pretty much all the time.   Mascarade : Deduction/bluffing game. Requires constant attention by everyone.   No Thanks! : Bidding game with very quick turns.   Escape: The Curse of the Temple : Simultaneous dice-rolling game with time-limit.   "},
{"sgreasby": "  Sushi Go Party!  Easy to pick up but can still be a challenge predicting what your neighbor is doing. Non-gamers all seem to really like it.  Saboteur  This is a really simple yet fun social deduction game where you may lose even if you figure out which side everyone is on.  "},
{"ldpaulson": " Around here, the 5P games that would come out would be (in no particular order):   Zero Down ;  Century: Spice Road  (thinky, but easy to teach and learn);  Get the MacGuffin  (quick and silly);  Fab Fib  (also quick and silly); and well, we like Las Vegas.  Good gaming! "},
{"Calcapone": "   Kingdomino   Love Letter   Machi Koro: Bright Lights, Big City  Maybe these could help "},
{"jokris": "  sgreasby wrote:   Sushi Go Party!  Easy to pick up but can still be a challenge predicting what your neighbor is doing. Non-gamers all seem to really like it.  Saboteur  This is a really simple yet fun social deduction game where you may lose even if you figure out which side everyone is on.     Saboteur  with expansion looks like a good game for 4-5 players. Also  The Mind  looks interesting. "},
{"Professor X": " King of Tokyo / King of New York  "},
{"qudoz": "  Dixit   Sushi Go!  +1  Love Letter  "},
{"spllr": " Looks like you should try  Magic Maze    Meeple Circus    If you play with five you could go for social deduction games like  The Resistance  /  The Resistance: Avalon   Human Punishment: Social Deduction 2.0  or party games like  Just One   Detective Club   Edit: How could i forget to mention  Galaxy Trucker ? But if you want to play it with 5 players you need  Galaxy Trucker: The Big Expansion .   "},
{"jokris": "  spllr wrote:  Looks like you should try  Magic Maze    Meeple Circus    If you play with five you could go for social deduction games like  The Resistance  /  The Resistance: Avalon   Human Punishment: Social Deduction 2.0  or party games like  Just One   Detective Club   Edit: How could i forget to mention  Galaxy Trucker ? But if you want to play it with 5 players you need  Galaxy Trucker: The Big Expansion .     Galaxy Trucker would be too hard to understand, also space theme is not interesting. Magic Maze looks interesting though. "},
{"sgreasby": "  jokris wrote:   Saboteur  with expansion looks like a good game for 4-5 players. Also  The Mind  looks interesting.   I would recommend playing without the expansion a few times first.  The expansion does not add much complexity the some of new roles can be confusing. In the original you are either helping or obstructing, is is very straight forward. I still highly recommend the expansion, just introduce it after a few rounds. "},
{"jokris": "  sgreasby wrote:   jokris wrote:   Saboteur  with expansion looks like a good game for 4-5 players. Also  The Mind  looks interesting.   I would recommend playing without the expansion a few times first.  The expansion does not add much complexity the some of new roles can be confusing. In the original you are either helping or obstructing, is is very straight forward. I still highly recommend the expansion, just introduce it after a few rounds.   How well does the base game work with four players? "},
{"Collando": "  6 nimmt!  "},
{"MLowrey": "  Coloretto  "},
{"NeedsNewDice": "  jokris wrote:  We were playing some games today (30-35 year old friends).  However  Camel Up  was too many rules for some of them and we also felt we had to wait a bit too long for our turn. Las Vegas was not everyone's cup of tea either, slightly because of the downtime until your next turn.  Games that were successful and brought us a lot of laughs were:  * Cards Against Humanity * Telestrations * Going Going Gone * Diamant  Next time we will probably try Mysterium.  What other fun games would you recommend?  I guess I am looking for: * easy rules * fun * short downtime until your next turn * 4-5 players   If Camel Up had too many rules and seemed to have some length between turns, then I would steer clear of Mysterium. In my experience, it's a bit convoluted to explain to more casual-minded crowds.   Not saying it can't be done, but  Dixit  is a much better choice for the type of group you're describing. It moves a ton faster, less rules, and is more open-minded. Mysterium can  be a bit restrictive and you can get cards that just aren't useful.   I'd also second looking at  Incan Gold  (which someone else mentioned as Diamant), especially if you like a little push-your-luck, and  Sushi Go . "},
{"nexttothemoon": " Azul - 4 players Crokinole - 4 players Codenames - 4+ players Sagrada - 4 players or 5 with the expansion. Splendor - 4 players Ticket to Ride - 4 or 5 players  "},
{"jpj2": " I will also get behind Sushi Go Party.   My wife would tell you to buy  Pluckin' Pairs  "},
{"Dodb66": "  Modern Art : plays great 3 to 5, no downtime at all, tons of fun, easy rules, love this game. "},
{"atmpoison": " Hi, the first one I thought of while reading you was King of the Dice, maybe a dexterity game like Junk Art, I'm waiting for Men at work, it's a game like that. Dungeon Raiders could be fine for you. Good luck! "}
]