[
    {
        "user": "rubzn852",
        "comment": " Hi everyone! I’m relatively new to board games when compared to the great majority of people around here. I have been looking for a really nice two players board game. I already have a few games in mind. But still I would like some experts opinions. Thanks in advance. So I’m looking for a game with strong mechanics, some complexity, time is not a problem (I’m ok with the lengths of twilight struggle and SW Rebellion), and high replayability value. I’m open to all kinds of games: card drafting, area influence/management, tile placing. Doesn’t matter. So can you guys help me? Thanks everyone "
    },
    {
        "user": "Eldard",
        "comment": " Ruben, here's our list of over 80 2-player games that my wife and I have played when we go out for coffee.  All play in an hour or less. Maybe you'll find something you like on it.   You and me . . . and coffee make three   "
    },
    {
        "user": "cowchip7",
        "comment": " Here are some of the simpler 2-player games I enjoy with my wife:   7 Wonders Duel   Patchwork   Lost Cities   Battle Line   Can't Stop  "
    },
    {
        "user": "Cardboard Conundrum",
        "comment": " My favourite exclusively two-player game is probably  7 Wonders: Duel , so I'd recommend checking that out if you haven't already. But there's a tonne of great two-player games out there - hard to only pick one or two to recommend! "
    },
    {
        "user": "AdelinDumitru",
        "comment": " These kind of threads usually lead to the same old recommendations: usually 2-player only games, with no or too little meat on them. Patchwork, Battle Line, Star Realms, 7 Wonders Duel are all  cute , but ultimately fall short of being exciting. You may try  BattleLore (Second Edition)  or  War of the Ring (Second Edition)  for a 2-player only epic game.   However, I'd advise you to turn your attention to games that support more players but work greatly with 2, especially if those 2 players have the same experience with the game:   Great Western Trail   Legendary: A Marvel Deck Building Game   Terraforming Mars   Carcassonne: Over Hill and Dale   Grand Austria Hotel   The Voyages of Marco Polo   Gaia Project   Seasons   Mombasa  "
    },
    {
        "user": "NeilDT",
        "comment": " I'd recommend  Castles of Burgundy  and  Seasons  as 4 player games that play better with 2; for 2 player games it's hard to look past  7 Wonders Duel  and  Targi  - if you can find a copy. "
    },
    {
        "user": "meshnaster",
        "comment": "  AdelinDumitru wrote:  These kind of threads usually lead to the same old recommendations: usually 2-player only games, with no or too little meat on them. Patchwork, Battle Line, Star Realms, 7 Wonders Duel are all  cute , but ultimately fall short of being exciting. You may try  BattleLore (Second Edition)  or  War of the Ring (Second Edition)  for a 2-player only epic game.   However, I'd advise you to turn your attention to games that support more players but work greatly with 2, especially if those 2 players have the same experience with the game:   Great Western Trail   Legendary: A Marvel Deck Building Game   Terraforming Mars   Carcassonne: Over Hill and Dale   Grand Austria Hotel   The Voyages of Marco Polo   Gaia Project   Seasons   Mombasa    Battle Line is more fulfilling and meaty than literally every other game mentioned in your list. It is much more than merely cute. "
    },
    {
        "user": "acedaryl1",
        "comment": "  The Fox in the Forest  is a trick taking 2-player game. Surprisingly strategic for a small card game.  "
    },
    {
        "user": "FrostyAnkles",
        "comment": " Hey guys/gals  I have been having tough time trying to pick my \"first\" dudes on a map game.  There seems to be a lot of good options and its tough to know what I will enjoy.   I caught bug after playing  Root . While I enjoy the game It left me wanting more. It seems to suffer from balance issues and I am not a big fan of the combat. This is my opinion of course.   I have been considering the following games and would appreciate any input on the subject.   Kemet   Cyclades   Cry Havoc   Nexus Ops   I really appreciate the help guys.   "
    },
    {
        "user": "cool1wow",
        "comment": " Hello, I'd greatly appreciate recommendations for games that have:   1) high levels of player interaction, contention, aggression AND  2) moderate to high levels of thematic immersion AND  3) strategy AND  4) minimal amounts of luck (some luck is OK) AND  5) direct competition and direct conflict AND 6) 2 hours or less to play (even with 4 people)    What I've realized is neither just Euro nor Ameritrash games are scratching the itch I have. I need qualities from both styles. I need the perfect (or close to perfect) strategy from Euros. I need the high level of interaction, aggression, and theme from Ameritrash games. Please help me in the quest to find games that fit all the qualities listed above.    What makes the list:  - Alien Frontiers - Twilight Struggle - Citadels - Small World  - A Brief History of the World  What does NOT make the list:   - Agricola is multiplayer solitaire. It is not interactive enough, and has no direct conflict.   - Tigris and Euphrates (not thematic enough)  - Twilight Imperium and Eclipse (too long, &gt; 2 hours)   - Troyes ...I have not played Troyes, but I do not think it would based on what I have read (not enough thematic immersion) and competition is not direct. "
    },
    {
        "user": "jokris",
        "comment": " We were playing some games today (30-35 year old friends).  However  Camel Up  was too many rules for some of them and we also felt we had to wait a bit too long for our turn. Las Vegas was not everyone's cup of tea either, slightly because of the downtime until your next turn.  Games that were successful and brought us a lot of laughs were:  * Cards Against Humanity * Telestrations * Going Going Gone * Diamant  Next time we will probably try Mysterium.  What other fun games would you recommend?  I guess I am looking for: * easy rules * fun * short downtime until your next turn * 4-5 players "
    },
    {
        "user": "AdelinDumitru",
        "comment": "  meshnaster wrote:   AdelinDumitru wrote:  These kind of threads usually lead to the same old recommendations: usually 2-player only games, with no or too little meat on them. Patchwork, Battle Line, Star Realms, 7 Wonders Duel are all  cute , but ultimately fall short of being exciting. You may try  BattleLore (Second Edition)  or  War of the Ring (Second Edition)  for a 2-player only epic game.   However, I'd advise you to turn your attention to games that support more players but work greatly with 2, especially if those 2 players have the same experience with the game:   Great Western Trail   Legendary: A Marvel Deck Building Game   Terraforming Mars   Carcassonne: Over Hill and Dale   Grand Austria Hotel   The Voyages of Marco Polo   Gaia Project   Seasons   Mombasa    Battle Line is more fulfilling and meaty than literally every other game mentioned in your list. It is much more than merely cute.   Sure, why not.  "
    },
    {
        "user": "PerpetualFX",
        "comment": " Best ones for me are  War of the Ring (Second Edition)  and  Star Wars: Rebellion  for longer games, and  Raptor  for something quick.   "
    },
    {
        "user": "dtwiley",
        "comment": " This is my niche, as I review a lot of games from the 2-player experience. I'd echo War of the Ring and Battle Line as great additions.  Star or Hero Realms is a nice deck builder that plays relatively quick.  Hanamikoji is, pound for pound, the best 2-player only game on the market and will be reprinted soon.  The Castles of Burgundy and Seasons, as previously mentioned, are best with 2.  I really love Kingdom Builder and Mystic Vale, both games that are fun with 2 and scale well going up to 4 players.  BattleCON is a fun take-that fighting game for 2 players.  Viticulture: Essential Edition plays great from 1-6. Honestly, this is as good with any count out there.  I'd love to chat more, especially if you see games I've reviewed that you want to see if they still hold up, etc.  "
    },
    {
        "user": "Sandmanx82",
        "comment": "  Claustrophobia  - 2p Asymmetric dungeon crawl, type game that plays in 45 minutes, looks gorgeous (as it comes with prepainted minis), and has tons of replayability with two expansions and tons of fan-made scenarios to play through.   Grand Austria Hotel  - This is in the same category as something like Seasons or Castles of Burgundy, where it plays more than two, but is best with two. This game is similar to Castles of Burgundy in a lot of ways, but has a completely different theme and nicer components.   Santorini  - The best abstract game I've ever played. This one has so much replayability with all the God powers and goes even more with the expansion. This one will have you thinking and thinking and will also be over with in about fifteen minutes. Onitama or Seikatsu are other good ones in this genre.   Too Many Bones  - This game scales very well, and is amazing solo, but will have you absolutely drooling over the component quality and will last many, many plays due to the insane level of difficulty coupled with the incredible depth of the characters.    Cosmic Run: Rapid Fire  - A really fun roll and write game (which is a hot genre right now) where you're traversing through space trying to get your three ships to their planets before your opponent. There is a lot to like about this fun little RaW. Castles of Burgundy The Dice Game is also a really good one in this genre.   The Ravens of Thri Sahashri  - A very unique and fantastical asymmetric 2p card game about...well you'll have to research for yourself. It's a very fun experience once you learn the ruleset.   Star Wars: Destiny  - My favorite game of all time. This game has the fun factor more than any other game I've ever played. You can just get two sets of the 2p starter set and have a blast for a while before you need to expand. It is a CCG-style game so you will be spending money buying boosters, but the game has a format geared towards newer players, so the barrier for entry isn't that steep.    Agility  - Very cute themed game about a dog show. There are more interesting decisions than you'd think in this little game, and I really enjoy it. It also has little dog-bone meeples. It's possibly less replayable than the others on this list, but is really fun. "
    },
    {
        "user": "Symath",
        "comment": " Based on what you've written in the OP?  War of the Ring   ( Battle Line  is also good. And  Innovation . But they're both shorter games.) "
    },
    {
        "user": "Rickrage",
        "comment": " Lost Cities probably my favorite 2 player at this time. "
    },
    {
        "user": "Gregrrr",
        "comment": "  cowchip7 wrote:  Here are some of the simpler 2-player games I enjoy with my wife:   7 Wonders Duel   Patchwork   Lost Cities   Battle Line   Can't Stop    Excellent suggestions. I'm more of a fan of  Cottage Garden  and  Schotten Totten  than Patchwork and Battle Line, but those games are still awesome. Can't go wrong here for 2-player light. "
    },
    {
        "user": "Swaygodeus",
        "comment": " Haven't played any of those but Kemet seems to get high praise. I guess part of it would be what you are looking for? Area control? Dice/No Dice?  I would hands down recommend  Blood Rage  as it's just such a finely tuned game.  "
    },
    {
        "user": "AHShole",
        "comment": "  FrostyAnkles wrote:  Hey guys/gals  I have been having tough time trying to pick my \"first\" dudes on a map game.  There seems to be a lot of good options and its tough to know what I will enjoy.   I caught bug after player  Root . While I enjoy the game It left me wanting more. It seems to suffer from balance issues and I am not a big fan of the combat. This is my opinion of course.   I have been considering the following games and would appreciate any input on the subject.   Kemet   Cyclades   Cry Havoc   Nexus Ops   I really appreciate the help guys.     I havent played Root.  What didnt you like about the combat in it? "
    },
    {
        "user": "Saytrsong",
        "comment": "  Lords of Hellas  for sure! "
    },
    {
        "user": "crazybyzantine",
        "comment": " If it’s your first one, Nexus Ops.  It’s widely seen as the essence of the genre and simple mechanics.  Then branch out to all the others. "
    },
    {
        "user": "FrostyAnkles",
        "comment": "  AHShole wrote:   FrostyAnkles wrote:  Hey guys/gals  I have been having tough time trying to pick my \"first\" dudes on a map game.  There seems to be a lot of good options and its tough to know what I will enjoy.   I caught bug after player  Root . While I enjoy the game It left me wanting more. It seems to suffer from balance issues and I am not a big fan of the combat. This is my opinion of course.   I have been considering the following games and would appreciate any input on the subject.   Kemet   Cyclades   Cry Havoc   Nexus Ops   I really appreciate the help guys.     I havent played Root.  What didnt you like about the combat in it?   1. Randomness of dice rolls. 2. Luck of draw for ambush cards.   I am fine with some luck but it felt like if you drew really poorly and rolled badly then it didnt matter what your strategy was. There were some things to offset this but overall It lacked the epic struggle I was looking for. Still a great game but did not scratch my itch.  "
    },
    {
        "user": "TeeJz",
        "comment": " How about Scythe?  Although eng bldg game does have combat and cool minis   "
    },
    {
        "user": "andreiszabo",
        "comment": " From your list, I would choose Kemet. But you're missing out on the greatest area control game ever...  El Grande ! "
    },
    {
        "user": "Ikehouserock",
        "comment": "  Spartacus: A Game of Blood &amp; Treachery  "
    },
    {
        "user": "wizardinwhite",
        "comment": " You don't want much, do you?  . Perhaps  Nexus Ops . "
    },
    {
        "user": "ukyo24",
        "comment": " Wow.. exactly what I'm looking for these days..  I thought Exodus would do the trick and awaiting for the shipment     https://boardgamegeek.com/boardgame/122842/exodus-proxima-ce...  "
    },
    {
        "user": "papagamer72",
        "comment": "  Eclipse  "
    },
    {
        "user": "allegro",
        "comment": " This is EXACTLY what i am looking for some time...  Any suggestions? "
    },
    {
        "user": "AceAceBaby",
        "comment": "  Chaos in the Old World  thanks you for your application. \"Eurotrash\" at its best. "
    },
    {
        "user": "odie73",
        "comment": "   Bohnanza : Trading game which involves everyone pretty much all the time.   Mascarade : Deduction/bluffing game. Requires constant attention by everyone.   No Thanks! : Bidding game with very quick turns.   Escape: The Curse of the Temple : Simultaneous dice-rolling game with time-limit.   "
    },
    {
        "user": "sgreasby",
        "comment": "  Sushi Go Party!  Easy to pick up but can still be a challenge predicting what your neighbor is doing. Non-gamers all seem to really like it.  Saboteur  This is a really simple yet fun social deduction game where you may lose even if you figure out which side everyone is on.  "
    },
    {
        "user": "ldpaulson",
        "comment": " Around here, the 5P games that would come out would be (in no particular order):   Zero Down ;  Century: Spice Road  (thinky, but easy to teach and learn);  Get the MacGuffin  (quick and silly);  Fab Fib  (also quick and silly); and well, we like Las Vegas.  Good gaming! "
    },
    {
        "user": "Calcapone",
        "comment": "   Kingdomino   Love Letter   Machi Koro: Bright Lights, Big City  Maybe these could help "
    },
    {
        "user": "jokris",
        "comment": "  sgreasby wrote:   Sushi Go Party!  Easy to pick up but can still be a challenge predicting what your neighbor is doing. Non-gamers all seem to really like it.  Saboteur  This is a really simple yet fun social deduction game where you may lose even if you figure out which side everyone is on.     Saboteur  with expansion looks like a good game for 4-5 players. Also  The Mind  looks interesting. "
    },
    {
        "user": "Professor X",
        "comment": " King of Tokyo / King of New York  "
    },
    {
        "user": "cafin8d",
        "comment": "  meshnaster wrote:  Battle Line is more fulfilling and meaty than literally every other game mentioned in your list. It is much more than merely cute.  I would love some elaboration of this thought. I've passed over Battle Line myself because it has a 1.9 weight (compared to Terraforming Mars which is a 3.25).  Tell me why this is a mistake    What makes it meaty to you despite its relatively low weight? "
    },
    {
        "user": "Sydeshow4",
        "comment": " 7 Wonders Duel is definite.  New game Prowlers Passage looks very promising. "
    },
    {
        "user": "R3DSH1FT",
        "comment": " Checkout  Rahdo Runsthrough  videos here/YouTube who also plays two player. After watching for a bit you’ll have a good idea for yourself if it’s something you’ll enjoy instead of relying on opinions.  "
    },
    {
        "user": "Cro1",
        "comment": " Some of these are not exclusively 2 player games but are great with 2 nonetheless. One of my fav 2 player games (Top five at the top and then in no particular order after that):   Summoner Wars    7 Wonders Duel   Sub Terra     Le Havre   Ascension   Santorini   Memoir 44     Heroes of Normandie     Schotten Totten   Port Royal    Pandemic Chuthulu      Letters From White Chapel   Roll for the Galaxy   Castles of Mad King Ludwig   City of Spies   Fuse   5 Minute Dungeon   Holmes: Sherlock &amp; Mycroft   Mysterium   Paperback   Race Formula 90     Black Orchestra         "
    },
    {
        "user": "Gregrrr",
        "comment": "  cafin8d wrote:   meshnaster wrote:  Battle Line is more fulfilling and meaty than literally every other game mentioned in your list. It is much more than merely cute.  I would love some elaboration of this thought. I've passed over Battle Line myself because it has a 1.9 weight (compared to Terraforming Mars which is a 3.25).  Tell me why this is a mistake    What makes it meaty to you despite its relatively low weight?   Remember that Weight and Depth are two very different yet often connected things.  Battle Line's weight might not be that high, because it is relatively simple to learn, but it's depth is notably great, which is what Mark meant by \"Meaty\", because there is a lot of depth to sink your teeth into.  Weight usually implies the amount of complexity that a game DEMANDS that you learn in order to play, while depth usually implies the amount of complexity that a game OFFERS UNDER IT'S SURFACE of standard gameplay.  Most of my favorite games have lower weight and higher depth. They allow you to focus on fewer things and have greater variables and possibilities for strategy and choices.  It's pretty ridiculous to dismiss lower weight games as being invaluable. "
    },
    {
        "user": "FrostyAnkles",
        "comment": "  Saytrsong wrote:   Lords of Hellas  for sure!   I considered Lord of hellas but for the price I could get 2 on the list.  "
    },
    {
        "user": "krede60",
        "comment": " I dont think you can wrong with Rising Sun as a dudes on a map game.  Also, the combat system is unique and definitely not random.  It's a tough sstem with a lot of guessing (you need to figure out what your opponent is likely to do and plan ahead even before that to have enough resources, but it's not at all random.    I dont know enough about the games already on your list to make a suggestion from those.   "
    },
    {
        "user": "bird94us",
        "comment": " Can't go wrong with  Chaos in the Old World .  One of the best games ever made.  Another great dark-humor option  is  Tomorrow . "
    },
    {
        "user": "sloshedeviloven",
        "comment": "  Mage Wars Arena  "
    },
    {
        "user": "Carthoris",
        "comment": " I like Nexus Ops, but I wouldn't call its randomness \"minimal.\"   For your criteria I'd recommend  Kemet  in a heartbeat. "
    },
    {
        "user": "bird94us",
        "comment": " If you want a speedy 2p game, try  Sun Tzu .  The only randomness is which special cards (in addition to the 6 cards you get to use each turn) you draw at the beginning of each turn, and both players will use the same types of cards each game.  A game can end in as quickly as 5 minutes, or as long as 20, and it's all about conflict. "
    },
    {
        "user": "nyem24",
        "comment": " I would say  Diplomacy  if you used a variant to cut the playtime down.  People have been punched in the face and tables flipped over this game. "
    },
    {
        "user": "qudoz",
        "comment": "  Dixit   Sushi Go!  +1  Love Letter  "
    },
    {
        "user": "spllr",
        "comment": " Looks like you should try  Magic Maze    Meeple Circus    If you play with five you could go for social deduction games like  The Resistance  /  The Resistance: Avalon   Human Punishment: Social Deduction 2.0  or party games like  Just One   Detective Club   Edit: How could i forget to mention  Galaxy Trucker ? But if you want to play it with 5 players you need  Galaxy Trucker: The Big Expansion .   "
    },
    {
        "user": "jokris",
        "comment": "  spllr wrote:  Looks like you should try  Magic Maze    Meeple Circus    If you play with five you could go for social deduction games like  The Resistance  /  The Resistance: Avalon   Human Punishment: Social Deduction 2.0  or party games like  Just One   Detective Club   Edit: How could i forget to mention  Galaxy Trucker ? But if you want to play it with 5 players you need  Galaxy Trucker: The Big Expansion .     Galaxy Trucker would be too hard to understand, also space theme is not interesting. Magic Maze looks interesting though. "
    },
    {
        "user": "sgreasby",
        "comment": "  jokris wrote:   Saboteur  with expansion looks like a good game for 4-5 players. Also  The Mind  looks interesting.   I would recommend playing without the expansion a few times first.  The expansion does not add much complexity the some of new roles can be confusing. In the original you are either helping or obstructing, is is very straight forward. I still highly recommend the expansion, just introduce it after a few rounds. "
    },
    {
        "user": "Tariff",
        "comment": " For epic games Rebellion or War of the Ring.  Meaty euro I'd recommend  Le Havre    Raptor  is a great shorter game.  I also really enjoy Dice masters.  I like  Dungeons &amp; Dragons Dice Masters: Battle for Faerûn  best.   BattleLore (Second Edition)  is superb if you like combat  "
    },
    {
        "user": "cafin8d",
        "comment": "  Gregrrr wrote:  Weight usually implies the amount of complexity that a game DEMANDS that you learn in order to play, while depth usually implies the amount of complexity that a game OFFERS UNDER IT'S SURFACE of standard gameplay.   I understand your point but I'm not sure I agree that most people consider weight to equal rules complexity. I think rules complexity and depth both contribute to the weight. (I wish bgg had separate rankings, but alas).  As support for my point, Concordia is extremely simplistic on rules complexity and yet shows a 3.1 weight because of depth.   Gregrrr wrote:  It's pretty ridiculous to dismiss lower weight games as being invaluable.  I never said invaluable. But, based on my personal perception of the bgg weight scale, which includes depth as a metric, it is a good litmus test. Even if someone did see 1.9 weight === depth, its still not invaluable because many people love lighter games. It just depends on what the potential buyer is looking for.  At any rate, I'll take a closer look at the game since a few people are in fact suggesting there is surprising depth here.  Thanks for the response. "
    },
    {
        "user": "Gregrrr",
        "comment": "  cafin8d wrote:   Gregrrr wrote:  Weight usually implies the amount of complexity that a game DEMANDS that you learn in order to play, while depth usually implies the amount of complexity that a game OFFERS UNDER IT'S SURFACE of standard gameplay.   I understand your point but I'm not sure I agree that most people consider weight to equal rules complexity. I think rules complexity and depth both contribute to the weight. (I wish bgg had separate rankings, but alas).  As support for my point, Concordia is extremely simplistic on rules complexity and yet shows a 3.1 weight because of depth.   Gregrrr wrote:  It's pretty ridiculous to dismiss lower weight games as being invaluable.  I never said invaluable. But, based on my personal perception of the bgg weight scale, which includes depth as a metric, it is a good litmus test. Even if someone did see 1.9 weight === depth, its still not invaluable because many people love lighter games. It just depends on what the potential buyer is looking for.  At any rate, I'll take a closer look at the game since a few people are in fact suggesting there is surprising depth here.  Thanks for the response.   I agree that not all of the \"weight\" ratings are a reflection of Rules Complexity (example: Go has 3.98) however, I think that it definitely reflects rules complexity more than actual depth much more often (90+% of the time in my opinion), because when people are actually quantifying a games \"weight\" on BGG, I don't think that they often asking themselves \"how much depth does this have.\" Instead, they are asking themselves \"How hard was this to learn.\"   Oh and, forgive me if I was unclear, I wasn't accusing you of treating simple games with depth as \"invaluable\" it was Adelin that was being dismissive of other's suggestions. I know you just wanted more information on Battle Line having Depth.  Thank you, friend   "
    },
    {
        "user": "GreatDebate",
        "comment": " Claustrophobia "
    },
    {
        "user": "mekanikal fiend",
        "comment": " omens. "
    },
    {
        "user": "stanstanminson",
        "comment": "  TeeJz wrote:  How about Scythe?  Although eng bldg game does have combat and cool minis    There's not enough (and sometimes no) combat in a game of Scythe to qualify it as a Dudes on a Map game. "
    },
    {
        "user": "stanstanminson",
        "comment": "  andreiszabo wrote:  From your list, I would choose Kemet. But you're missing out on the greatest area control game ever...  El Grande !  Nitpick but El Grande is an area influence game, not area control. Dudes on a Map games are almost always area control. "
    },
    {
        "user": "snapdragon23",
        "comment": "  Carcassonne.   Surely that counts   "
    },
    {
        "user": "FrostyAnkles",
        "comment": "  stanstanminson wrote:   TeeJz wrote:  How about Scythe?  Although eng bldg game does have combat and cool minis    There's not enough (and sometimes no) combat in a game of Scythe to qualify it as a Dudes on a Map game.   This.  Plus I will add that I am not a fan of Scythe. I may even go as far as to say I dislike it.  "
    },
    {
        "user": "FrostyAnkles",
        "comment": "  snapdragon23 wrote:   Carcassonne.   Surely that counts        I think you confused Dudes on a map with meeples on tiles.   "
    },
    {
        "user": "charlest",
        "comment": "  Cyclades   Blood Rage  "
    },
    {
        "user": "GoodOmens",
        "comment": "  AceAceBaby wrote:   Chaos in the Old World  thanks you for your application. \"Eurotrash\" at its best.   Listen to this man and heed his advice.  Also, Neuroshima Hex is a knife-fight in a phone booth. "
    },
    {
        "user": "Hornauer",
        "comment": " +1 to Chaos in the old World!  +0.75 to Kemet "
    },
    {
        "user": "lindelos",
        "comment": " 1)  BattleCON: War of Indines . One of the best 2player games I own. Great community that only seems to be growing stronger. HIGH levels of interaction, NO luck, thematic immersion (of a sort because your character IS getting the stuffing beaten out of them or you're the one stuffin' the snot outta someone else), DIRECT conflict, and even your first game won't take more than an hour. It's a game that rewards multiple, multiple plays and your playing time will dwindle rapidly down to about 15-30min per match.  2) I'm going to get punched in the face for this but...  Alchemists . Once you've gotten through the rather lengthy rules explanation/understanding, my gaming group has not gone over 2hrs. Direct competition on so many fronts, no  real  luck whatsoever, HEAVY strategy (there are quite a few interesting paths to victory), and HIGHLY thematic (you'll actually feel like some wacky alchemist). It also has one of the most satisfying conclusions I've had gaming in a while: you feel a sense of resolve and finality when the game is over which is not something I have encountered in a lot of games which makes you feel that maybe a turn or two longer would've provided the same feeling. Are you getting the nebulous thoughts that I'm putting down?  Good luck! "
    },
    {
        "user": "Thanee",
        "comment": " Take a closer look at  Clockwork Wars . It should cover all your requirements.  Bye Thanee  "
    },
    {
        "user": "jokris",
        "comment": "  sgreasby wrote:   jokris wrote:   Saboteur  with expansion looks like a good game for 4-5 players. Also  The Mind  looks interesting.   I would recommend playing without the expansion a few times first.  The expansion does not add much complexity the some of new roles can be confusing. In the original you are either helping or obstructing, is is very straight forward. I still highly recommend the expansion, just introduce it after a few rounds.   How well does the base game work with four players? "
    },
    {
        "user": "Collando",
        "comment": "  6 nimmt!  "
    },
    {
        "user": "MLowrey",
        "comment": "  Coloretto  "
    },
    {
        "user": "NeedsNewDice",
        "comment": "  jokris wrote:  We were playing some games today (30-35 year old friends).  However  Camel Up  was too many rules for some of them and we also felt we had to wait a bit too long for our turn. Las Vegas was not everyone's cup of tea either, slightly because of the downtime until your next turn.  Games that were successful and brought us a lot of laughs were:  * Cards Against Humanity * Telestrations * Going Going Gone * Diamant  Next time we will probably try Mysterium.  What other fun games would you recommend?  I guess I am looking for: * easy rules * fun * short downtime until your next turn * 4-5 players   If Camel Up had too many rules and seemed to have some length between turns, then I would steer clear of Mysterium. In my experience, it's a bit convoluted to explain to more casual-minded crowds.   Not saying it can't be done, but  Dixit  is a much better choice for the type of group you're describing. It moves a ton faster, less rules, and is more open-minded. Mysterium can  be a bit restrictive and you can get cards that just aren't useful.   I'd also second looking at  Incan Gold  (which someone else mentioned as Diamant), especially if you like a little push-your-luck, and  Sushi Go . "
    },
    {
        "user": "nexttothemoon",
        "comment": " Azul - 4 players Crokinole - 4 players Codenames - 4+ players Sagrada - 4 players or 5 with the expansion. Splendor - 4 players Ticket to Ride - 4 or 5 players  "
    },
    {
        "user": "snapdragon23",
        "comment": "  FrostyAnkles wrote:   snapdragon23 wrote:   Carcassonne.   Surely that counts        I think you confused Dudes on a map with meeples on tiles.     Meeples are peoples too...? "
    },
    {
        "user": "Saytrsong",
        "comment": "  FrostyAnkles wrote:   Saytrsong wrote:   Lords of Hellas  for sure!   I considered Lord of hellas but for the price I could get 2 on the list.    True, it is a little pricey, but you definitely get your money's worth. Quality is top notch, solo play works well and overall replayabliity has been great for me so far.    Another really good one is  Dust . Still a little on the pricey side and you'd have to snag one from ebay or the geek market.  "
    },
    {
        "user": "gamesgocrazy",
        "comment": "  Pax Porfiriana  "
    },
    {
        "user": "bwarner34",
        "comment": " How about  Smash Up ? "
    },
    {
        "user": "star_man",
        "comment": " Check out warchess-x the armageddon "
    },
    {
        "user": "Rob Doupe",
        "comment": "  Age of Empires III: The Age of Discovery    Carson City    Imperial 2030  "
    },
    {
        "user": "jpj2",
        "comment": " I will also get behind Sushi Go Party.   My wife would tell you to buy  Pluckin' Pairs  "
    },
    {
        "user": "Dodb66",
        "comment": "  Modern Art : plays great 3 to 5, no downtime at all, tons of fun, easy rules, love this game. "
    },
    {
        "user": "Bulldog74",
        "comment": "  Swaygodeus wrote:  Haven't played any of those but Kemet seems to get high praise. I guess part of it would be what you are looking for? Area control? Dice/No Dice?  I would hands down recommend  Blood Rage  as it's just such a finely tuned game.    If you are looking for more strategy and less luck. I recommend blood rage as well.  I also like zombicide: black plague but that adds more luck.  "
    },
    {
        "user": "vanquish7",
        "comment": " Would second Blood Rage or Root.  Blood Rage if you like crazy combos and bluffing. It very easy to pick up and play as well. The whole 'you can win by losing' thing is genius as unlike typical area control/war games, in Blood Rage (and Rising Sun too) you are unsure about whether attacking your opponents is a good idea or not - as they might be wanting you to attack them all along! Which leads to lots of mind games (not to mention the ensuing cursing and general hilarity).  Root if you want more of a traditional war game with dice rolls but with such a great deal of asymmetry that some factions aren't even playing an area control game. It isn't actually that hard to teach as most of what players need to know is printed on their player mats. The biggest problem with Root is that turns are long until players are experienced with the game.  And I'd definitely not consider Scythe as scratching the 'dudes on a map' itch, it's very much a euro engine builder with some combat tacked on (and players aren't encouraged to go out and fight their opponents either).  Heard good things about Lords of Hellas and Kemet as well but yet to try them.  Rising Sun is also great, but it's more a game of diplomatic war like the Game of Thrones game, which might not be to everyones taste. You certainly have a lot less player agency compared to Blood Rage or Root. "
    },
    {
        "user": "Jopo43",
        "comment": " BLOOD RAGE!!!!! "
    },
    {
        "user": "pacman88k",
        "comment": " If conflict is important,  Inis .  If not,  Scythe . "
    },
    {
        "user": "EgorjLileli",
        "comment": " What meets all your criteria EXCEPT the playing time is  Dominant Species .  There is a card game version, but I haven't played it. "
    },
    {
        "user": "atmpoison",
        "comment": " Hi, the first one I thought of while reading you was King of the Dice, maybe a dexterity game like Junk Art, I'm waiting for Men at work, it's a game like that. Dungeon Raiders could be fine for you. Good luck! "
    },
    {
        "user": "kaziam",
        "comment": " Don’t forget  Inis . Minimalistic, gorgeous and very thinky with 3 win conditions.  You’re definitely playing against the players here. "
    },
    {
        "user": "Valnar",
        "comment": " If you want a FUN \"dudes on a map\" game try Smallworld. Or if you want a real \"dudes on a map\" game try a wargame like Battle of the Bulge: Celles, see Stuka Joe's excellent video.  "
    },
    {
        "user": "Denga",
        "comment": " Scythe is my favorite but definitely lower on the player conflict side (so freaking great though).  Blood Rage is probably my favorite conflict driven game like this because it’s fun, has great cinematic moments, and plays quick.  If you want something heavier and more asymmetric then Cthulhu Wars is another good one. "
    },
    {
        "user": "Surge1000",
        "comment": " Of those you listed, Kemet is best by a mile. "
    },
    {
        "user": "Adria",
        "comment": "  Spartacus: A Game of Blood &amp; Treachery  was the first game that came to mind based on the thread title, but there might be a little too much luck in that for you (everyone's definition of 'minimal' is different  ). Lots of bribery and backstabbing in this one, and play time can be managed a bit by varying your starting influence.   Chaos in the Old World  is another good suggestion.    Tammany Hall  might not come off as super thematic, but it's a great game. Players vie for political control of New York in the Gangs of New York era. No direct aggression, but lots of opportunities for deal-making and deal-breaking.    Evolution  and  Cthulhu Wars  might also be worth a look. "
    },
    {
        "user": "kaziam",
        "comment": "  Clockwork Wars  seconded!  Amazing epic conflict game in a lean, mean package.   Tammany Hall -- Believe it or not this is a vicious game and very thematic.  You can flick your imaginary cigar ash at your opponents as you rig elections in this tight area control game.  Finally  Dune  or the more readily available  Rex: Final Days of an Empire  are very confrontational with very little luck. "
    },
    {
        "user": "DaveyJJ",
        "comment": "  nyem24 wrote:  I would say  Diplomacy  if you used a variant to cut the playtime down.  People have been punched in the face and tables flipped over this game.  Coming here to suggest this until I saw the play-time requirement. Never seen anyone physically assaulted but have seen vicious screaming matches, and I personally haven't spoken to one guy since high school in the 1970s after one especially nasty back-stab he pulled. Traitor. Can't play this anymore, trying to keep my blood pressure in check. "
    },
    {
        "user": "meshnaster",
        "comment": "  Gregrrr wrote:   cafin8d wrote:   Gregrrr wrote:  Weight usually implies the amount of complexity that a game DEMANDS that you learn in order to play, while depth usually implies the amount of complexity that a game OFFERS UNDER IT'S SURFACE of standard gameplay.   I understand your point but I'm not sure I agree that most people consider weight to equal rules complexity. I think rules complexity and depth both contribute to the weight. (I wish bgg had separate rankings, but alas).  As support for my point, Concordia is extremely simplistic on rules complexity and yet shows a 3.1 weight because of depth.   Gregrrr wrote:  It's pretty ridiculous to dismiss lower weight games as being invaluable.  I never said invaluable. But, based on my personal perception of the bgg weight scale, which includes depth as a metric, it is a good litmus test. Even if someone did see 1.9 weight === depth, its still not invaluable because many people love lighter games. It just depends on what the potential buyer is looking for.  At any rate, I'll take a closer look at the game since a few people are in fact suggesting there is surprising depth here.  Thanks for the response.   I agree that not all of the \"weight\" ratings are a reflection of Rules Complexity (example: Go has 3.98) however, I think that it definitely reflects rules complexity more than actual depth much more often (90+% of the time in my opinion), because when people are actually quantifying a games \"weight\" on BGG, I don't think that they often asking themselves \"how much depth does this have.\" Instead, they are asking themselves \"How hard was this to learn.\"   Oh and, forgive me if I was unclear, I wasn't accusing you of treating simple games with depth as \"invaluable\" it was Adelin that was being dismissive of other's suggestions. I know you just wanted more information on Battle Line having Depth.  Thank you, friend     Battle Line, on first glance, is about playing your cards in a way to create the best sets you can. After a couple of plays, it's easier to see that more than just the sets you play, but the order you play them, and where you play them, is key to winning. After a little bit more, it becomes easier to read your opponent's side of the table as more than just what sets they are building, but what cards they may have, and what cards they may be waiting for or are bluffing. After even more, the sets themselves are no longer what you spend your time thinking about, but how to set traps for your opponent to bait them to play cards that will give you enough information to make your next move more intelligently. There may be more depth than that, but that's about where I am.  Then I play something like Terraforming Mars, with a much higher BGG weight, which has significantly more rules complexity and after playing it several times, each play seems about as straightforward as it was the first time (it does have some variety in the volume of cards, but the variety adds breadth instead of depth).  Fwiw, when I play Battle Line, I technically am playing the original Schotten Totten, since I don't use tactics cards or 10's. "
    },
    {
        "user": "RottenJeeves",
        "comment": "  meshnaster wrote:   Gregrrr wrote:   cafin8d wrote:   Gregrrr wrote:  Weight usually implies the amount of complexity that a game DEMANDS that you learn in order to play, while depth usually implies the amount of complexity that a game OFFERS UNDER IT'S SURFACE of standard gameplay.   I understand your point but I'm not sure I agree that most people consider weight to equal rules complexity. I think rules complexity and depth both contribute to the weight. (I wish bgg had separate rankings, but alas).  As support for my point, Concordia is extremely simplistic on rules complexity and yet shows a 3.1 weight because of depth.   Gregrrr wrote:  It's pretty ridiculous to dismiss lower weight games as being invaluable.  I never said invaluable. But, based on my personal perception of the bgg weight scale, which includes depth as a metric, it is a good litmus test. Even if someone did see 1.9 weight === depth, its still not invaluable because many people love lighter games. It just depends on what the potential buyer is looking for.  At any rate, I'll take a closer look at the game since a few people are in fact suggesting there is surprising depth here.  Thanks for the response.   I agree that not all of the \"weight\" ratings are a reflection of Rules Complexity (example: Go has 3.98) however, I think that it definitely reflects rules complexity more than actual depth much more often (90+% of the time in my opinion), because when people are actually quantifying a games \"weight\" on BGG, I don't think that they often asking themselves \"how much depth does this have.\" Instead, they are asking themselves \"How hard was this to learn.\"   Oh and, forgive me if I was unclear, I wasn't accusing you of treating simple games with depth as \"invaluable\" it was Adelin that was being dismissive of other's suggestions. I know you just wanted more information on Battle Line having Depth.  Thank you, friend     Battle Line, on first glance, is about playing your cards in a way to create the best sets you can. After a couple of plays, it's easier to see that more than just the sets you play, but the order you play them, and where you play them, is key to winning. After a little bit more, it becomes easier to read your opponent's side of the table as more than just what sets they are building, but what cards they may have, and what cards they may be waiting for or are bluffing. After even more, the sets themselves are no longer what you spend your time thinking about, but how to set traps for your opponent to bait them to play cards that will give you enough information to make your next move more intelligently. There may be more depth than that, but that's about where I am.  Then I play something like Terraforming Mars, with a much higher BGG weight, which has significantly more rules complexity and after playing it several times, each play seems about as straightforward as it was the first time (it does have some variety in the volume of cards, but the variety adds breadth instead of depth).  Fwiw, when I play Battle Line, I technically am playing the original Schotten Totten, since I don't use tactics cards or 10's.    Battle Line  Is probably my favorite 2 player game I have played. My wife loves it too!    "
    },
    {
        "user": "Ninjabob",
        "comment": "  Lord of the Rings: The Confrontation  or  Lord of the Rings: The Confrontation  are superb 2 player games "
    },
    {
        "user": "andrewvanlaar",
        "comment": " My wife and I really like  Jaipur   "
    },
    {
        "user": "MRSalem",
        "comment": " The Mrs and I really enjoy Jaipur, Summoner Wars, Eko, Sonar, and Via Nebula as filler to light-medium games. While I enjoyed Raptor, the wife loathed it with a passion.  "
    },
    {
        "user": "emutheelf",
        "comment": "  Five Tribes   Hive   Aeon's End   San Juan   "
    },
    {
        "user": "markhelton",
        "comment": " Okay, so if you like games like  Star Wars: Rebellion , (Great Game, btw!), then I think you would like  War of the Ring (Second Edition)  as well.         Both are highly thematic, and both are fairly well balanced. (I actually prefer War of the Ring a bit more, but then I am not the biggest Star Wars fan around. However, my brother-in-law is a huge Star Wars fan, and I think even he thinks that War of the Ring is better, (albeit just slightly better). I will point out that War of the Ring is a bit more of a wargame than Star Wars Rebellion is, but not so much as to be daunting to non-wargame players, (at least not IMHO).  Good Luck in your search! "
    },
    {
        "user": "RottenJeeves",
        "comment": "  andrewvanlaar wrote:  My wife and I really like  Jaipur    +1 "
    },
    {
        "user": "jpj2",
        "comment": " There are so many great 2 player games. I will add  Mr. Jack  or  Le Fantôme de l'Opéra  if you could find it. Or check my microbadge for my personal favorite 2 player game. The GIPF series is also great.  "
    },
    {
        "user": "bm72",
        "comment": " My fiance started with Lost Cities and Jaipur.  Then we found Battle Lines, Patchwork, and Hive.  We have played 7 Wonders Duel but she's not up to the strategy just yet.    I say start with something light and relatively lightweight like Lost Cities and Jaipur then move on from there.  Have fun! "
    },
    {
        "user": "Langalore",
        "comment": " I don’t think I saw it mentioned here but my vote is for:  At the Gates of Loyang  - my favorite game. A Rosenburg design about farming with great meeples and a lot of decisions.   Arboretum  - getting reprinted later this year. Echoing what someone else said, low weight (easy to understand rules) but so much depth. Deciding what to discard every turn is one of the hardest decisions I’ve ever made in a board game. Such an excellent game!  Biblios  - we loved this game when we were starting in the hobby 3 years ago. It’s great with 2. Sort of a drafting / auction / market manipulation game that’s easy to understand and fun to play.    Ditto to some of the others- Viticulture Hanamikoji Jaipur Lost Cities  You should mention the games you have on your mind.  "
    },
    {
        "user": "SuperGLS",
        "comment": " Lots of good ones already mentioned.  But the best is  Fields of Arle .  Everyone agrees. "
    },
    {
        "user": "kawlaw",
        "comment": "  Battle Line   Targi   Hive   Quarto   Arboretum   These are great and challenging games when you both are serious competitive gamers.  Good luck! "
    },
    {
        "user": "Dodb66",
        "comment": " easy   Food Chain Magnate    no doubt about it   Others that are good   Innovation   Omen: A Reign of War   7 Wonders Duel   Madeira  ... "
    },
    {
        "user": "Little White Lies",
        "comment": "   Combat Commander: Europe  "
    },
    {
        "user": "elclarkey",
        "comment": " Check out this list that I maintain when I have time:   **Elclarkey Big Lists:  Two Player Dandies**  "
    },
    {
        "user": "gohawks",
        "comment": " I applaud your selection of Tammany Hall, and I think it feels totally thematic which is why it is one of my favorites. It is totally tense, totally strategic. You are encouraged to negotiate and wheedle. And then stab each other in the back. With the variable office powers a nd Vying to use immigrant populations against each other, being the most successful scumbag has never been so fun. With the OP's original selection of games and what he's asking for, this is a slam dunk. Only issue which doesn't bother me, every placement is so tense that there is some AP going on. "
    },
    {
        "user": "Tango Papa Delta",
        "comment": " 1.  CRIBBAGE 2.  MARVEL LEGENDARY 3.  TWILIGHT STRUGGLE 4.  MEMOIR '44 5.  VICTORY IN THE PACIFIC "
    },
    {
        "user": "jellojt38",
        "comment": "  (2-player only)   Raptor   Pagoda   Codenames Duet   Niya   Hive Pocket  +1  Patchwork  +1  7 Wonders Duel  +1  Lost Cities    (Others we play 2-player)   Splendor   NMBR 9   Lanterns   Karuba  +1  Santorini  +1  Kingdom Builder  +1  Paperback   "
    },
    {
        "user": "Dymphna33",
        "comment": " Some of our favorite two-player games:  Onitama (I gave this to everyone last Christmas!) Battle Line Hanamikoji Odin's Ravens Jaipur Morels Mr Jack The Fox in the Forest   Games that accommodate more but play well with two:  Azul Carcassonne Illimat    "
    },
    {
        "user": "ZUR13L",
        "comment": "  EXCEED Fighting System    Crystal Clans    Rum &amp; Bones: Second Tide    Hero Realms    Masmorra: Dungeons of Arcadia   Just a few things we've been enjoying...  Good luck!   Let us know what you find... "
    },
    {
        "user": "bm72",
        "comment": " I saw a suggestion for Codenames: Duet and I should have also made that recommendations.  Fiancee and I play this and we end up laughing a lot when we reveal our desired answers to our clues.  Fun game. "
    },
    {
        "user": "cool1wow",
        "comment": " Wow! Thanks for so many great suggestions everyone! Keep them coming!   Games mentioned that look awesome and I am going to order:  - Pax Porfiriana (love card driven historical games) - Clockwork Wars (love non-trading card driven games) - Chaos in the Old World  - Alchemists - Tammany Hall   Games mentioned that look promising:  - Kemet - Age of Empires III - Carson City  - Spartacus   Re: person who mentioned \"Dominant Species\" - that game looks like EXACTLY what i want, I had researched it before I even started this thread. When I saw the play time though   I will probably still check it out though, even though it isn't under 2 hours. Looks too good (modular board, dog eat dog atmosphere, impending doom)     papagamer72 wrote:   Eclipse    Can Eclipse be played in 2 hours with 4 people?  "
    },
    {
        "user": "Mythologem",
        "comment": "  cool1wow wrote:  Can Eclipse be played in 2 hours with 4 people?   I'd rather play   Space Empires 4X   than Eclipse anytime; SE4X in 2 hours with 4 is a bit of a stretch but it's doable based on the scenario, and after a firm grasp of the (intuitive, streamlined and fully customizable) rules.  Also,   Dune   is pretty much exactly what you're looking for &amp; more - but the playtime (4 hours +). As someone correctly stated,  Dune is THE game for jerks .  A PnP of Dune (latest revised ruleset) beats Rex by a mile in my book (even if the treachery cards in the final score are a nice touch), but I get that if you're not into DIY, Rex may be cushy.  The same team that made Dune has also made  Cosmic Encounter , but it's more luck-filled and random. Quite nasty though.  Check also: -   Roborally   -   Colt Express   -   Room 24   -   Meuterer    Honorable mention,  Here I Stand , but the shortest 1532-43 scenario takes up to ~5 hours (6 players). The longest one... well :) "
    },
    {
        "user": "mgreen02",
        "comment": "  cool1wow wrote:  Re: person who mentioned \"Dominant Species\" - that game looks like EXACTLY what i want, I had researched it before I even started this thread. When I saw the play time though   I will probably still check it out though, even though it isn't under 2 hours. Looks too good (modular board, dog eat dog atmosphere, impending doom)   There are a few ways to shorten Dominant Species to inside 2 hours, the easiest of which is to remove 4 cards that grant extra actions:  Omnivore Intelligence Parasitism Immigrants  (I think this improves the game anyway as there is less queuing for cards that could be annoyingly advantageous to some players not others).  The game plays perfectly well without those cards and in a shorter time frame with less AP potential. Winner.    There is also a cardless varient:      https://www.boardgamegeek.com/thread/722588/official-cardles...    "
    },
    {
        "user": "dbelousov",
        "comment": " I've spent days putting the list together and here is what I've ended up with    1. Gloomhaven 2. Descent: Journeys in the Dark 3. Pathfinder Adventure Card Game: Rise of the Runelords 4. Star Wars: Imperial Assault 5. Mechs vs. Minions 6. Mage Knight 7. Arcadia Quest: Inferno 8. Darkest Night 9. Shadows of Brimstone: City of the Ancients 10. Sword &amp; Sorcery  What do you think guys? I've also reviewed them here -  https://boardgamesland.com/best-rpg-board-games/  "
    },
    {
        "user": "jhaelen",
        "comment": "  dbelousov wrote:  I've spent days putting the list together and here is what I've ended up with    1. Gloomhaven 2. Descent: Journeys in the Dark 3. Pathfinder Adventure Card Game: Rise of the Runelords 4. Star Wars: Imperial Assault 5. Mechs vs. Minions 6. Mage Knight 7. Arcadia Quest: Inferno 8. Darkest Night 9. Shadows of Brimstone: City of the Ancients 10. Sword &amp; Sorcery  What do you think guys? I've also reviewed them here -  https://boardgamesland.com/best-rpg-board-games/  I like your reviews, but I'm not sure how relevant they are to this thread.  I also disagree quite a bit about some of these games: Good games: 1. Gloomhaven 5. Mechs vs. Minions 6. Mage Knight 7. Arcadia Quest: Inferno  Average games: 2. Descent: Journeys in the Dark 4. Star Wars: Imperial Assault 10. Sword &amp; Sorcery  Bad games: 3. Pathfinder Adventure Card Game: Rise of the Runelords 9. Shadows of Brimstone: City of the Ancients  Can't say: 8. Darkest Night  "
    },
    {
        "user": "ZUR13L",
        "comment": "  Dice Throne: Season One  is quite good.   I'm looking forward to season 2. "
    },
    {
        "user": "MisterG",
        "comment": " Many wargames would fit the requirements if both players know what they're doing. "
    },
    {
        "user": "Randougall",
        "comment": " I think  Cyclades  would fit the requirements nicely!  "
    },
    {
        "user": "jlgern",
        "comment": " Pax Porfiriana New Era Dominant Species +1 Space Empires 4x +1 Rex "
    },
    {
        "user": "Dostradamas",
        "comment": "  El Grande  5 way knife fight in a dark phone booth.   Caylus  My wimpy a$$ play group whines \"the provost is just mean.\"  +1 to  Tammany Hall  last game we played was flat brutal every turn.  Maybe  Belfort  "
    },
    {
        "user": "sloan66",
        "comment": " OK.  I'll take a stab at this.   Fief: France 1429   or  Stronghold  might fit the bill.  Both games are going to run longer then two hours though.  But they do hit  every  other item on your list.  Fief is currently in print, so you wouldn't have any trouble finding it,and Stronghold Second Edition should be out in October. "
    },
    {
        "user": "yiupublishingcompany",
        "comment": " If you are a word lover  Captain Can Spell  "
    },
    {
        "user": "epilepticemu",
        "comment": " To echo what a few have already said   Cyclades  (3-5)  Chaos in the Old World  (3-4)  Rex: Final Days of an Empire  (best 4-6, though)  You're not going to find many games in this category that play well (or at all) at 2 players. For a great 2 player game look at  Lord of the Rings: The Confrontation . "
    },
    {
        "user": "cool1wow",
        "comment": "  epilepticemu wrote:  To echo what a few have already said   Cyclades  (3-5)  Chaos in the Old World  (3-4)  Rex: Final Days of an Empire  (best 4-6, though)  You're not going to find many games in this category that play well (or at all) at 2 players. For a great 2 player game look at  Lord of the Rings: The Confrontation .   Don't care too much about 2 player games (although suggestions are welcome).   Someone mentioned to me that Chaos in the Old World has high amounts of luck? Is this true? That would mean it does not fit my requirements.  "
    },
    {
        "user": "epilepticemu",
        "comment": "  cool1wow wrote:   epilepticemu wrote:  To echo what a few have already said   Cyclades  (3-5)  Chaos in the Old World  (3-4)  Rex: Final Days of an Empire  (best 4-6, though)  You're not going to find many games in this category that play well (or at all) at 2 players. For a great 2 player game look at  Lord of the Rings: The Confrontation .   Don't care too much about 2 player games (although suggestions are welcome).   Someone mentioned to me that Chaos in the Old World has high amounts of luck? Is this true? That would mean it does not fit my requirements.    No. On a luck scale from 1 (flipping a coin) to 10 (chess), I'd say CitOW is about a 6.5. Cyclades is a 7. Rex is a 8.   "
    },
    {
        "user": "Russell King",
        "comment": "  Junta  "
    },
    {
        "user": "ninja poodle",
        "comment": " cosmic encounter? might not be as strategic as some games but it has A LOT of player interaction as two players will have an encounter (usually a battle but can be a deal) each turn and all the other players can join in as allies so there is heaps of negotiation.       "
    },
    {
        "user": "sao123",
        "comment": "  cool1wow wrote:    Can Eclipse be played in 2 hours with 4 people?     After a few plays to get the rules down - YES.   Exodus: Proxima Centauri  +  Exodus: Edge of Extinction    New Dawn ?   Pocket Imperium    Imperial Settlers    The Manhattan Project    Smash Up  "
    },
    {
        "user": "star_man",
        "comment": " Check out this new modern warfare wargame with a highly strategic, epic and immersive world war 3 theme;  WarChess-X: The Armageddon  "
    },
    {
        "user": "sychobob",
        "comment": "  sloan66 wrote:  OK.  I'll take a stab at this.   Fief: France 1429   or  Stronghold  might fit the bill.  Both games are going to run longer then two hours though.  But they do hit  every  other item on your list.  Fief is currently in print, so you wouldn't have any trouble finding it,and Stronghold Second Edition should be out in October.   Fief should fit the requirement of low luck? In no way!  +1 Kemet Low luck - check Highly agressive - check 2h - check Thematic - check The most aggressiv euro i know of. "
    },
    {
        "user": "cool1wow",
        "comment": "  Thanee wrote:  Take a closer look at  Clockwork Wars . It should cover all your requirements.  Bye Thanee    I finally played Clockwork Wars. You were right. It fit all the requirements in my original post. Amazing game. 10/10 for me. Criminally underrated. Need to spread the word about it.  "
    },
    {
        "user": "pacman88k",
        "comment": "  The Estates  "
    },
    {
        "user": "FrostyAnkles",
        "comment": "  Surge1000 wrote:  Of those you listed, Kemet is best by a mile.   Strongly considering both Kemet and blood rage. They seem different enough to justify both.   Especially since it seems to be the majority vote here.     On a side note I have played both Inis and Cyclades and I enjoyed them both a great deal. Perhaps I am over thinking this. Hmm... "
    },
    {
        "user": "shieldwolf",
        "comment": " Chaos in the old World Rising Sun Lords of Hellas Kemet Blood Rage  "
    },
    {
        "user": "Dodb66",
        "comment": " Nexus Ops and Cyclades are extremly good games  Kemet not so much, the turn order system is broken. I see it more as a kids game and it attracts people that dislike dice but still want something wargamy.   878: Vikings – Invasions of England  is very good, very enjoyable experience    "
    },
    {
        "user": "monstrooper",
        "comment": " Based on what you're looking for, another vote for Kemet.  There are different rules to resolve turn order if you have the expansion.  For the base game, turn order is determined by the player with the lowest vps.  Combat is resolved by cards, no dice.  The game is focused on combat, winning battles and taking over temple spaces are the primary ways of scoring vps.  Nexus Ops is OK, but uses dice to resolve combat.  It is also the lightest game in terms of complexity on your list.  Cyclades has more eurogame elements and is less focused on combat.  Cry Havoc just didn't work for me in general for a variety of reasons so I would not recommend. "
    },
    {
        "user": "Stomski",
        "comment": " Check here ---&gt;  The Dudes on a Map Collector (2019)  "
    },
    {
        "user": "jhaelen",
        "comment": "  FrostyAnkles wrote:  I have been considering the following games and would appreciate any input on the subject.   Kemet   Cyclades   Cry Havoc   Nexus Ops   My personal favorite of these four is Cyclades, but it doesn't actually have a lot of direct conflict.  Kemet is definitely more in-the-face.  I also like Cry Havoc, but like the (excellent)  Chaos in the Old World  it has very asymmetric factions, so you may want to be careful if you're worried about balance issues.  I see 'Nexus Ops' purely as an entry-level 'dudes-on-a-map' game, but it's probably the best. There's also 'Small World', which I consider very fun.  'Blood Wars' is a good choice if you enjoy drafting cards, but imho 'Inis' does a better job in that regard and 'Rising Sun' beats 'Blood Wars' in every other regard.   Clockwork Wars  is great, very underrated dudes-on-a-map game with secret, simultaneous unit deployment and high replayability.  Stomski wrote:  Check here ---&gt;  The Dudes on a Map Collector (2019)  Alas, this list is mostly useless since it considers every game a 'dudes-on-a-map' game that isn't either a dungeon crawler or an adventure game. "
    },
    {
        "user": "Tariff",
        "comment": " All the listed games are great and different. "
    },
    {
        "user": "cradleofmilk",
        "comment": "  Tariff wrote:  All the listed games are great and different.   Definitely. Played most listed. All are solid and have different aims. Would add Shogun (the Wallenstein retheme), Tempus, and Risk:Legacy to the suggestions.   But Blood Rage and Kemet are great standard suggestions.  "
    },
    {
        "user": "FrostyAnkles",
        "comment": " Thank you all for your suggestions. I added every game to a spreadsheet and I am carefully considered all of them.  "
    },
    {
        "user": "Dodb66",
        "comment": "  monstrooper wrote:  Based on what you're looking for, another vote for Kemet.  There are different rules to resolve turn order if you have the expansion.  For the base game, turn order is determined by the player with the lowest vps.  Combat is resolved by cards, no dice.  The game is focused on combat, winning battles and taking over temple spaces are the primary ways of scoring vps.  Nexus Ops is OK, but uses dice to resolve combat.  It is also the lightest game in terms of complexity on your list.  Cyclades has more eurogame elements and is less focused on combat.  Cry Havoc just didn't work for me in general for a variety of reasons so I would not recommend.   Not everyone sees diceless combat as a benefit. I've played around 10 games of Kemet and haven't lost a single one but haven't really enjoyed them either because there's little tension. And it's not even like there is no randomness, while the cards, when you remember what everyone played give you a good degree of certainty the DI cards introduce randomness and so does multiplayer play. Take away that randomness and it all comes down to turn order making the game even worse then it is. The player who goes last has the biggest potential of running away with the game, this is a problem in all these types of games but in Kemet it really stands out in my opinion. The better people get at this game the more turn order matters.  So it's not like it's not random, it's just very exciting. Dice introduce tension, you don't know with 100% certainty you can win but you can still optimise. Also you have good and bad implementations of dice combat. If you have silly low percentages of hitting then I agree, dice lead to frustration but there are many games where the probabilities are really good depending on how wel you play. That's good fun because there's little to no frustration but still on occasion things go wrong and that keeps it tense (the whole dopamine thing), good tactics get rewarded but you never really know. I think a fear of dice comes from playing bad games mostly unless you are a chess player or someone really used to open information and zero randomness. I can respect that.    "
    },
    {
        "user": "FrostyAnkles",
        "comment": "  Dodb66 wrote:   monstrooper wrote:  Based on what you're looking for, another vote for Kemet.  There are different rules to resolve turn order if you have the expansion.  For the base game, turn order is determined by the player with the lowest vps.  Combat is resolved by cards, no dice.  The game is focused on combat, winning battles and taking over temple spaces are the primary ways of scoring vps.  Nexus Ops is OK, but uses dice to resolve combat.  It is also the lightest game in terms of complexity on your list.  Cyclades has more eurogame elements and is less focused on combat.  Cry Havoc just didn't work for me in general for a variety of reasons so I would not recommend.   Not everyone sees diceless combat as a benefit. I've played around 10 games of Kemet and haven't lost a single one but haven't really enjoyed them either because there's little tension. And it's not even like there is no randomness, while the cards, when you remember what everyone played give you a good degree of certainty the DI cards introduce randomness and so does multiplayer play. Take away that randomness and it all comes down to turn order making the game even worse then it is. The player who goes last has the biggest potential of running away with the game, this is a problem in all these types of games but in Kemet it really stands out in my opinion. The better people get at this game the more turn order matters.  So it's not like it's not random, it's just very exciting. Dice introduce tension, you don't know with 100% certainty you can win but you can still optimise. Also you have good and bad implementations of dice combat. If you have silly low percentages of hitting then I agree, dice lead to frustration but there are many games where the probabilities are really good depending on how wel you play. That's good fun because there's little to no frustration but still on occasion things go wrong and that keeps it tense (the whole dopamine thing), good tactics get rewarded but you never really know. I think a fear of dice comes from playing bad games mostly unless you are a chess player or someone really used to open information and zero randomness. I can respect that.      Well Said  Some of my favorite games use dice. (E.G  Troyes ) Perhaps I was too hasty to write off dice rolling for combat.   It sounds like If I decide on  Kemet  then I really need the expansion that resolves the turn over issues. It is also difficult to find around me. I may need to revisit this game at another time.   Clockwork Wars  Looks really good but It seems impossible to find a copy that isn't massively overpriced.   Blood Rage . I am leaning really heavily toward getting this one. I hesitate as I am not sure about depth.    Inis  &amp;  Cyclades  Played both these before like I mentioned and I really liked them. My hesitation is I can play them anytime at my local game store.    Cry Havoc  Looked good initially but I wrote it off as there seems to be a lot complaints about balance.    Nexus Ops  Is a mixed bag for me. I worry it might be too light and become boring quickly.   That's were I am at so far. Still have yet to look into other suggestions.          "
    },
    {
        "user": "heroesbane",
        "comment": " There's something to be said for dice based combat, the suspense and the excitement, where you try to mitigate dice rolls with sheer numbers.  Since you did ask for a \"My First Dudes on a Map\" game,  Nexus Ops  is the obvious choice especially if dice rolling appeals to you. Yes, it's OOP but it can be picked up fairly cheaply. It's not a meaty game, per se, but it plays so quick and so streamlined. With a modular board, it's one of the few DoaM games that's playable at 2p. It's one you might find hitting the table to kick off or end game night on a regular basis.   Risk Europe  - This is about as themeless as you can get with DoaM game. There is nothing here that draws you in. Playable with 3p but really shines at 4p. Nothing to write home about but the game play is, for lack of a better word, solid. It's cheap enough that it's worth picking up for when you're in the mood for a \"let's build some armies and attack some territories.\" It's not one you can necessarily play over and over again to refine your strategies for optimal play (which is what it sounds like you're after).    Mythic Battles: Pantheon  - This is more of a skirmish game. Although it lacks sheer numbers, since you're playing with a handful of units, it makes up for it with unit talents, powers, and clever gameplay. The dice base combat here is probably the best implementation ever. It's a shame that the only way to it for a fair price is when Monolith puts it up on Kickstarter. I do think Mythic Battles: Ragnarok is supposed to land on Kickstar this year. It's the same game system but uses Norse mythology instead of Greek mythology.   "
    },
    {
        "user": "epilepticemu",
        "comment": " Cyclades is amazing. Get it. And then get Cyclades: Titans expansion. Skip Hades.  "
    },
    {
        "user": "zachpas",
        "comment": "  FrostyAnkles wrote:  Hey guys/gals  I have been having tough time trying to pick my \"first\" dudes on a map game.  There seems to be a lot of good options and its tough to know what I will enjoy.   I caught bug after playing  Root . While I enjoy the game It left me wanting more. It seems to suffer from balance issues and I am not a big fan of the combat. This is my opinion of course.   I have been considering the following games and would appreciate any input on the subject.   Kemet   Cyclades   Cry Havoc   Nexus Ops   I really appreciate the help guys.     Personally my favorite on this list is  Cry Havoc  and it's one of my all-time favorite games. Like Root, Cry Havoc is HEAVILY asymmetrical and requires you to really get in depth with each faction and play to their strengths. You cannot play each faction the same and because of this it gets a bad wrap for being unbalanced but,  IT IS BALANCED . However you will need to invest time to learn each faction and their special abilities. Many of the detractors did not do this and that's why it's not nearly as popular as others on this list.  If that is not for you, then I would highly recommend  Blood Rage  over any of the others on your list. Blood Rage plays meh at 2, but amazing at all other player counts, and there are countless strategies to play. It's a ton of fun and one of the better dudes on a maps games out there. "
    },
    {
        "user": "jhaelen",
        "comment": "  epilepticemu wrote:  Cyclades is amazing. Get it. And then get Cyclades: Titans expansion. Skip Hades.  Alternatively skip Titans and get Hades. It really depends on how much you like the base game gameplay.  If you feel it offers too little conflicts, Titans will help with that. If you just want to improve the basic gameplay a little, Hades is the way to go.  Personally, I only use Titans to support 6 players. Imho, if you're really looking for a game with more conflicts, get Kemet.  "
    },
    {
        "user": "FrostyAnkles",
        "comment": " Thanks everyone again for your help.  I bought  Blood Rage . It seems really solid.   I put Inis, Kemet, Clockwork Wars, and Cyclades on my wish-list.   FA  "
    },
    {
        "user": "Rasdel",
        "comment": " Seeing your options I understand that these are not probably good options for you but...    Small World   I just love how easy and fast it is. And the replayability is off the charts. BUT, it's silly and lighthearted.    Age of Conan: The Strategy Board Game   I don't know if it's oop. It's an interesting take on the IP. I liked it a lot... pretty similar to RISK but adds a couple of interesting twists to the game.  IF you are looking for something new and shiny...    Blood Rage   hands down     Cheers   "
    },
    {
        "user": "Tariff",
        "comment": "  Quote:  Cyclades is amazing. Get it. And then get Cyclades: Titans expansion. Skip Hades.    Nah, avoid Titans and get Hades.  Titans tries to change Cyclades into kemet.   "
    },
    {
        "user": "karlvonl",
        "comment": "  Risk Europe : The original Risk is the granddaddy of dudes-on-a-map games, and Risk Europe is the best in the series, having been designed for the sensibilities of modern Euro gamers, and thus avoiding the flaws of its more old-fashioned predecessors.   Viktory II : Before Risk Europe came out, this was my usual recommendation for \"a better Risk than Risk\".   Small World , or its predecessor  Vinci : Gameplay consists of putting down dudes, and spreading them out on a map. Doesn't get much more dudes-on-a-map than that.   Eight-Minute Empire  or  Eight-Minute Empire: Legends : If you don't want the size, expense, or time commitment of a more epic offering, these games give you the dudes-on-a-map experience in a more filler-like package. (No combat though, just area control.) "
    },
    {
        "user": "picklethehutt",
        "comment": " Out of those listed, I prefer Cyclades, but that's only with the Titans expansion. The base game, while fine, is really improved with either big expansion, and I like Titans the best. "
    },
    {
        "user": "cradleofmilk",
        "comment": " Age of Conan as mentioned above is great too. A bit quirky, but a good time.  "
    },
    {
        "user": "Dodb66",
        "comment": " There are two types of cyclades players, those that like the base game (or better the actual game), these people love Hades as it is a really good upgrade for an already excellent game. Then there are those that don’t like cyclades but like it with Titans because Titans makes cyclades into a different game. For me Titans makes Cyclades into a chaotic multiplater wargame which I’m not a fan of and will avoid playing. If I want to play a chaotic multiplayer wargame I’ll pick Dominant Species over Cyclades Titans anytime.  "
    },
    {
        "user": "KristopherHickman",
        "comment": " Entry Level Dudes on a Map: Blood Rage -An extremely streamlined ruleset even for those players without much experience. I've personally used this game as a true gateway experience to convert 12-15 players who had never played anything but Monopoly and Risk. Downsides? You just missed the KS for upgrading your copy. I'd check with CMON to see if you can late pledge extras. As a KS backer myself, its worth it. "
    },
    {
        "user": "RottenJeeves",
        "comment": "  KristopherHickman wrote:  Entry Level Dudes on a Map: Blood Rage -An extremely streamlined ruleset even for those players without much experience. I've personally used this game as a true gateway experience to convert 12-15 players who had never played anything but Monopoly and Risk. Downsides? You just missed the KS for upgrading your copy. I'd check with CMON to see if you can late pledge extras. As a KS backer myself, its worth it.   Upgraded Blood Rage? I see the  digital is coming but I didn't see anything about upgrading physical copies.  "
    },
    {
        "user": "RottenJeeves",
        "comment": "  Dodb66 wrote:  Nexus Ops and Cyclades are extremly good games  Kemet not so much, the turn order system is broken. I see it more as a kids game and it attracts people that dislike dice but still want something wargamy.   878: Vikings – Invasions of England  is very good, very enjoyable experience      I don't mean to hijack this thread but I see you own the expansion. Do you think it fixes the issues with the base game? "
    },
    {
        "user": "AHShole",
        "comment": "  FrostyAnkles wrote:   AHShole wrote:   FrostyAnkles wrote:  Hey guys/gals  I have been having tough time trying to pick my \"first\" dudes on a map game.  There seems to be a lot of good options and its tough to know what I will enjoy.   I caught bug after player  Root . While I enjoy the game It left me wanting more. It seems to suffer from balance issues and I am not a big fan of the combat. This is my opinion of course.   I have been considering the following games and would appreciate any input on the subject.   Kemet   Cyclades   Cry Havoc   Nexus Ops   I really appreciate the help guys.     I havent played Root.  What didnt you like about the combat in it?   1. Randomness of dice rolls. 2. Luck of draw for ambush cards.   I am fine with some luck but it felt like if you drew really poorly and rolled badly then it didnt matter what your strategy was. There were some things to offset this but overall It lacked the epic struggle I was looking for. Still a great game but did not scratch my itch.     Cry Havoc  will be more what you are looking for.  Avoid  Nexus Ops  "
    },
    {
        "user": "vitus979",
        "comment": "  RottenJeeves wrote:  Upgraded Blood Rage? I see the  digital is coming but I didn't see anything about upgrading physical copies.    So, the first Kickstarter for Blood Rage had a lot of exclusives that became very expensive on the secondary market.  The digital Kickstarter for Blood Rage has a Physical Pledge that offers those exclusives that impact gameplay to those who don't have it, and some of the add-ons further add other exclusive content from the first Kickstarter (namely the plastic tokens).  The Stretch Goals added 3d tokens  similar to the ones from the original Kickstarter as well. "
    },
    {
        "user": "RottenJeeves",
        "comment": "  vitus979 wrote:   RottenJeeves wrote:  Upgraded Blood Rage? I see the  digital is coming but I didn't see anything about upgrading physical copies.    So, the first Kickstarter for Blood Rage had a lot of exclusives that became very expensive on the secondary market.  The digital Kickstarter for Blood Rage has a Physical Pledge that offers those exclusives that impact gameplay to those who don't have it, and some of the add-ons further add other exclusive content from the first Kickstarter (namely the plastic tokens).  The Stretch Goals added 3d tokens  similar to the ones from the original Kickstarter as well.   I see that now. Thanks.  "
    },
    {
        "user": "other_nebogipfel",
        "comment": "  Gregrrr wrote:  It's pretty ridiculous to dismiss lower weight games as being invaluable.  I know people hate it when someone does this, but to prevent an embarrassing error, 'invaluable' does not, as one would think, mean \"without value\". It actually means \"so valuable that the value can't be measured\" in other words \"extremely valuable\" or \"can't go without it\". I apologize for being grammar police.  By the way, why  do  people do this? Because  it's worse when it happens in real life . They're trying to spare you that. "
    },
    {
        "user": "ZUR13L",
        "comment": "  https://youtu.be/0b6_i_eSgR8     "
    },
    {
        "user": "Xylus",
        "comment": " Strongly recommend  Tak . It's got easy rules but deep strategy. Once you get over the initial stages of learning it can rack up in complexity very quick. Though the retail version is very expensive for the pieces you get. I recommend checking out the rules on the publisher's website and make your own set. "
    },
    {
        "user": "BustedKnuckleRustic",
        "comment": "        I agree, Tak is a great game, and not really that difficult to make.  Here is the version I made for myself.  There is just something about playing a game you made yourself.  No to be confused with creating yourself.  I did NOT create this game I just recreated my own version! "
    },
    {
        "user": "JJRR_Esq",
        "comment": " This thread had a good run, but I can officially end it:  Race for the Galaxy  "
    },
    {
        "user": "sonofbruce",
        "comment": "  Jaipur  is a lovely two p player game. Really easy to learn and massively replayable.   Photosynthesis  also works really nicely as a two player game due to having to plan ahead for future turns.  In terms of quickness, simplicity and fun then I highly recommend  Santorini , with or without the God cards. "
    },
    {
        "user": "Glass_Chameleon",
        "comment": " Well  The  Best two player game is  Go  . But what you are looking for is likely something different.   Check my Geek list for my suggestions.  My favorite games for 2 players  It's not a great list as I've quite neglected it and not put many comments on the items as to  why  I suggest them. But the games on it are all solid at two players.   "
    },
    {
        "user": "jack_alves",
        "comment": " I usually play 2 player games with my wife and the one that hits the table most is  Roll for the Galaxy  - great game and eye candy! If you like Sci-fi and Space exploration, you will love admiring the world you have built by the end of the game! It adds a bit of luck with a \"third player\" dice for role selection, but not too much luck to destroy the flow of the game. I highly recommend it.   Other games that we play:  Lord of the Rings: The Confrontation   Hive Pocket   Sherlock Holmes Consulting Detective   Small World   Great suggestions on this thread! "
    },
    {
        "user": "GrimThunderbrew",
        "comment": "  rubzn852 wrote:  Hi everyone! I’m relatively new to board games when compared to the great majority of people around here. I have been looking for a really nice two players board game. I already have a few games in mind. But still I would like some experts opinions. Thanks in advance. So I’m looking for a game with strong mechanics, some complexity, time is not a problem (I’m ok with the lengths of twilight struggle and SW Rebellion), and high replayability value. I’m open to all kinds of games: card drafting, area influence/management, tile placing. Doesn’t matter. So can you guys help me? Thanks everyone   If you are okay with Rebellion, I don't think you need any more 2 player games until you are tired of it.    However if you want short and meaty-  Race for the Galaxy   Mottainai  "
    },
    {
        "user": "Dragonette1218",
        "comment": " It looks like a lot of suggestions already. So just in case they are not there already, 5 minute Dungeon is fun with even just 2 player and another 2 player game we like is Hive. "
    },
    {
        "user": "moriarty",
        "comment": "  rubzn852 wrote:   But still I would like some experts opinions.   First thing is probably that people (even \"experts\") have wildly different taste. As an example, I just saw an hour long video of some reviewer showing off all the games he had brought home from the Essen 2018 fair, and not one of them made me curious.   Quote:  So I’m looking for a game with strong mechanics, some complexity, time is not a problem (I’m ok with the lengths of twilight struggle and SW Rebellion), and high replayability value. I’m open to all kinds of games: card drafting, area influence/management, tile placing. Doesn’t matter. So can you guys help me? Thanks everyone   There are probably so many which fulfills those criteria that it's easier to do a search and find the first one by ranking that you can get hold of. Availability is probably the main issue for recommendations. ... or better yet. Find the nearest other board gamer in the area and see what's on the shelves in his/her collection.  Since you're Portuguese, maybe try some of  Vital Lacerda 's games. He has made a few games which have gotten very nice reviews. I've recently purchased  Vinhos Deluxe Edition  , but not had the chance to play it yet.  Other than that, I think you need to quantify \"some complexity\" and \"time is not a problem\" ... some games are *very* complex and others take well above 200 hours - but if you have the time it's often worth it.    "
    },
    {
        "user": "LucasKragh",
        "comment": " Definately  7 wonders duel  for one of the best designed euro games striking a perfect balance between easy accesibility but enough variety in regards to different tactics of how to win the game.  Another game that i am surprised to not see mentioned is  Warhammer Underworlds Shadespire . Amazing skirmish game in my opinion and beats battlelore even if not exactly comparable but scratches the same itch. "
    },
    {
        "user": "PeterTroyes111",
        "comment": "  Glüx   Targi   Splendor  "
    },
    {
        "user": "jrubin1",
        "comment": "  AdelinDumitru wrote:  These kind of threads usually lead to the same old recommendations: usually 2-player only games, with no or too little meat on them. Patchwork, Battle Line, Star Realms, 7 Wonders Duel are all  cute , but ultimately fall short of being exciting. You may try  BattleLore (Second Edition)  or  War of the Ring (Second Edition)  for a 2-player only epic game.   However, I'd advise you to turn your attention to games that support more players but work greatly with 2, especially if those 2 players have the same experience with the game:    Mombasa    Mombasa perfect at 2!!! "
    },
    {
        "user": "Kollppo",
        "comment": " We love Pandemic!! "
    },
    {
        "user": "Thomas29",
        "comment": " Another Geeklist you can check out is:   What Couples Have Been Playing — November 2018   This also has short reviews on how they play with 2 players. A new list every month. "
    },
    {
        "user": "dbelousov",
        "comment": " Thanks for your feedback!  "
    },
    {
        "user": "johnchristian",
        "comment": " Depends to whom I am playing with.  With my wife, beside  7 Wonders Duel , I play Reversi ( Othello ). It's a quick and tense abstract classic game that looks like Go but it's much more approachable. At first you feel just reacting and don't know what to do, but after just understanding (or reading a few paragraphs) of strategy and after a few games, things became very tense and the best part is that at the very end the board can completely change. It happens often that which of the last two possible moves you play be the difference between loosing and winning. So no time to be bored. Did I mentioned it's quick and compact?  With my little daughter I started playing  Forbidden Island  because she needs support. And she is captivated by the story. So much than when winning she must put all the figurines on and the helicopter card on the exit hexagon and to literally fly them of the table, and then she would destroy the island left behind with her hands. I also have Pandemic but it's too complicated for her.  With some male friends and my father I play  Backgammon  "
    },
    {
        "user": "kedveil",
        "comment": "  Caverna: Cave vs Cave  Me, as mostly casual gamer find this game pretty awesome: 2 player only, relatively complex, and fun to play. Got this to play with my wife, and she really liked it, despite she is not into board games!     Neuroshima Hex! 3.0  That I might also mention. I've only played this with 3 player setup. But I bet it's also fun as 2-player game.  There are also whole bunch of \"war games\" I suppose. But my very recent ones are:  Star Wars: X-Wing Miniatures Game    Gaslands  Both pretty similar to play, very customisable, which I enjoyed.  "
    },
    {
        "user": "ClueBotApp",
        "comment": " Hi! If you like the Clue board games, I made an app called ClueBot to make the game awesome in 2-Player format. I put a lot of time into it, I promise it's good!   The app builds the mystery and acts as Player 3 in most regards. Keeps the mystery in the game that Clue was designed to have.   https://itunes.apple.com/us/app/cluebot/id1450659384?uo=4&amp;mt...   "
    },
    {
        "user": "wolfthatwonders",
        "comment": "  In no certain order  stop thief pandemic Thunder and lighting, Android net runner Blue moon legends imperial settlers Thesus The dark orbit 7 wonder duel The Duke/The Jarl scoville  Starship Catan pecking order  thats what coming to mind a the moment     GloomHaven (this game is quick once you learn it and very rewarding Reccomend App Gloomhaven Helper to speed the game up also.)    Patch work i find boring fun to try for a few games  "
    },
    {
        "user": "RenaissanceMom",
        "comment": "  ClueBotApp wrote:  Hi! If you like the Clue board games, I made an app called ClueBot to make the game awesome in 2-Player format. I put a lot of time into it, I promise it's good!   The app builds the mystery and acts as Player 3 in most regards. Keeps the mystery in the game that Clue was designed to have.   https://itunes.apple.com/us/app/cluebot/id1450659384?uo=4&amp;mt...    Sounds interesting. Do you plan to release an android version? "
    }
]